Repository: donadigo/appeditor
Catalog: po/*.po
Languages: es, ru, sv

source: Edit application menu
es: Editar el menú de aplicaciones
ru: Редактируйте меню приложений
sv: Redigera programmenyn

source: Edit application entries shown in application menu and their properties.
es: Edite las entradas del menú de aplicaciones y sus propiedades.
ru: Редактируйте описания и свойства программ в меню приложений.
sv: Redigera programposterna som visas i menyn, och dess egenskaper.

source: Features include:
es: Algunas de las funcionalidades son:
ru: Возможности:
sv: Funktioner:

source: Hide and show applications from the application menu
es: Ocultar y mostrar entradas del menú de aplicaciones
ru: Скрытие и отображение программ в меню приложений
sv: Dölj och visa program i programmenyn.

source: Create new application entries
es: Crear entradas de aplicación nuevas
ru: Создание новых записей о приложениях
sv: Skapa nya programposter.

source: Change application's display name, icon and more
es: Cambiar el nombre mostrado de una aplicación, su icono y más
ru: Изменение имени приложения, иконки и многого другого
sv: Ändra programmens visningsnamn, ikon och mer.

source: This release makes AppEditor available on elementary OS 7. Many thanks to Ryo Nakano for his contributions to this release.
ru: Этот релиз делает AppEditor доступным в elementary OS 7. Большое спасибо Рё Накано за его вклад в этот выпуск.

source: New translations:
ru: Новые переводы:

source: Czech (Amerey)
ru: Чешский (Amerey)

source: This release fixes payments not working in the AppCenter.
ru: Этот релиз исправляет проблему с оплатой в AppCenter.

source: Swedish (Åke Engelbrektson)
ru: Шведский (Åke Engelbrektson)

source: This release updates AppEditor for elementary OS 6.1.
ru: Этот релиз делает AppEditor доступным в elementary OS 6.1.

source: This release makes AppEditor available on elementary OS 6.0.
ru: Этот релиз делает AppEditor доступным в elementary OS 6.0.

source: Portuguese-Portugal (rottenpants466)
ru: Португальский (rottenpants466)

source: This release includes translation updates:
ru: Этот релиз включает в себя обновления переводов:

source: Dutch translation (Heimen Stoffels)
ru: Голландский перевод (Heimen Stoffels)

source: Spanish, Catalan translation (Adolfo Jayme-Barrientos)
ru: Испанский и каталанский переводы (Adolfo Jayme-Barrientos)

source: Japanese translation (Ryo Nakano)
es: Traducción al japonés (Ryo Nakano)
ru: Японский перевод (Ryo Nakano)
sv: Japansk översättning (Ryo Nakano)

source: French translation (Nathan Bonnemains, dabou)
ru: Французский перевод (Nathan Bonnemains, dabou)

source: Turkish translation (Serdar Sağlam)
ru: Турецкий перевод (Serdar Sağlam)

source: Russian translation (Camellan)
ru: Русский перевод (Camellan)

source: Lithuanian translation (welaq)
ru: Литовский перевод (welaq)

source: Italian translation
ru: Итальянский перевод

source: This release includes added support for elementary OS Juno, miscellaneous improvements and new translations:
es: Esta versión incluye compatibilidad con elementary OS Juno, mejoras diversas y traducciones nuevas:
ru: В этом выпуске добавлена поддержка elementary OS Juno, различные улучшения и новые переводы:
sv: Denna utgåva lägger till stöd för elementary OS Juno, diverse förbättringar och nya översättningar:

source: German translation (ChristianPauly)
es: Traducción al alemán (ChristianPauly)
ru: Немецкий перевод (ChristianPauly)
sv: Tysk översättning (ChristianPauly)

source: Brazilian Portuguese translation (Filipe de Almeida Garrett)
es: Traducción al portugués brasileño (Filipe de Almeida Garrett)
ru: Бразильский португальский перевод (Filipe de Almeida Garrett)
sv: Brasilien-Portugisisk översättning (Filipe de Almeida Garrett)

source: New features:
es: Funcionalidades nuevas:
ru: Новые функции:
sv: Nya funktioner:

source: It is now possible to create a menu entry directly from the file manager: right click on an executable file and choose "Create a Menu Entry"
es: Ahora es posible crear una entrada de menú directamente desde el gestor de archivos: pulse con el botón derecho del ratón en un ejecutable y elija «Crear entrada de menú»
ru: Теперь можно создать пункт меню непосредственно из файлового менеджера: щёлкните правой кнопкой мыши на исполняемый файл и выберите «Создать пункт меню»
sv: Det är nu möjligt att skapa en menypost direkt från filhanteraren: Högerklicka på en körbar fil och välj "Skapa menypost".

source: New shortcuts added:
es: Se añadieron atajos nuevos:
ru: Добавлены новые сочетания клавиш:
sv: Nya genvägar tillagda:

source: Ctrl+N: Create a new menu entry
es: Ctrl+N: crear una entrada de menú nueva
ru: Ctrl+N: Добавить новое приложение
sv: Ctrl+N: Skapa ny menypost

source: Ctrl+F: Focus the search entry
es: Ctrl+F: focalizar el cuadro de búsqueda
ru: Ctrl+F: Переключиться на поиск
sv: Ctrl+F: Fokusera sökposten

source: Ctrl+D: Duplicate selected entry
es: Ctrl+D: duplicar la entrada seleccionada
ru: Ctrl+D: Дублировать выбранное приложение
sv: Ctrl+D: Duplicera markerad post

source: Fixed:
es: Correcciones:
ru: Исправления:
sv: Fixat:

source: Some strings are not displayed in translated languages (Ryo Nakano)
es: Algunas cadenas no aparecían traducidas en otras lenguas (Ryo Nakano)
ru: Некоторые строки не отображались на переведённых языках (Ryo Nakano)
sv: Vissa strängar visas inte på översatta språk (Ryo Nakano)

source: Improper escaping of special characters in display name and description
es: Escape incorrecto de caracteres especiales en los campos Nombre visible y Descripción
ru: Неправильное экранирование специальных символов в имени и описании приложений
sv: Felaktigt bortargumenterande av specialtecken i visningsnamn och beskrivning

source: This release contains many new features and bug fixes as well as added support for translations:
ru: Этот выпуск содержит много новых функций, исправлений ошибок и поддержку переводов:

source: French translation (dabou)
es: Traducción al francés (dabou)
ru: Французский перевод (dabou)
sv: Fransk översättning (dabou)

source: Russian translation (Cammelan)
es: Traducción al ruso (Cammelan)
ru: Русский перевод (Cammelan)
sv: Rysk översättning (Cammelan)

source: Spanish translation (Juan Gómez Carrillo)
es: Traducción al castellano (Juan Gómez Carrillo)
ru: Испанский перевод (Juan Gómez Carrillo)
sv: Spansk översättning (Juan Gómez Carrillo)

source: Added a button to duplicate a specific application entry
ru: Добавлена кнопка для дублирования приложения

source: New "Advanced" section: add a new "Uses Notifications" key
ru: Новый раздел «Дополнительно»: добавлен новый ключ «Использует уведомления»

source: Fixed crashes when saving an entry with an equal sign in its command line property
es: Se repararon los cuelgues al guardar una entrada con un signo de igualdad en la propiedad Línea de órdenes
ru: Исправлен сбой при сохранении записи со знаком равенства в свойстве командной строки

source: Sometimes deleting a local entry would cause it to stay in the sidebar until the next launch
es: A veces, eliminar una entrada local causaba que esta permaneciese en la barra lateral hasta el próximo inicio
ru: Иногда удаление локальной записи приводило к тому, что она оставалась в боковой панели до перезапуска
sv: Ibland gör borttagning av en lokal post att den stannar i sidofältet till nästa start.

source: Sometimes creating a new entry caused a crash
es: A veces, crear una entrada nueva causaba un cese de funcionamiento
ru: Иногда создание новой записи приводило к сбою
sv: Ibland orsakade skapandet av en ny post en krasch.

source: The page would not update after saving the entry
es: La página no se actualizaba después de guardar la entrada
ru: Страница не обновлялась после сохранения записи
sv: Sidan uppdateras inte när posten har sparats.

source: Miscellaneous:
es: Otros:
ru: Прочее:
sv: Diverse:

source: Save unsaved entries when quitting the application
es: Guardado de entradas sin guardar al salir de la aplicación
ru: Сохранение несохранённых записей при выходе из приложения
sv: Spara osparade poster när programmet avslutas

source: Clear the search entry when creating a new application entry
es: Se vacía el cuadro de búsqueda al crear una entrada de aplicación nueva
ru: Очистка строки поиска при создании новой записи приложения
sv: Rensa sökposten när en ny programpost skapas

source: Added a button to open the entry in a text editor
es: Se añadió un botón para abrir la entrada en un editor de texto
ru: Добавлена кнопка для открытия записи в текстовом редакторе
sv: Lade till en knapp för att öppna posten i en textredigerare

source: Added a switch to show hidden entries (disabled by default)
es: Se añadió un control para mostrar entradas ocultas (desactivado de manera predeterminada)
ru: Добавлен переключатель для отображения скрытых записей (по умолчанию отключён)
sv: Lade till en växel för att visa dolda poster (inaktiverad som standard)

source: Fixed some applications like Inkscape not saving their name properly
es: Se corrigió el problema que causaba que aplicaciones como Inkscape no pudieran guardar su nombre adecuadamente
ru: Исправлена ошибка, из-за которой некоторые приложения, такие как Inkscape, не сохраняли своё имя должным образом
sv: Fixade att vissa program, som Inkscape, inte sparade sitt namn ordentligt.

source: The main window can be now maximized
es: Ahora la ventana principal puede maximizarse
ru: Основное окно теперь можно развернуть на весь экран
sv: Huvudfönstret kan nu maximeras

source: Add meson dependency to debian packaging
es: Adición de Meson como dependencia para el empaquetado Debian
ru: Добавлена зависимость от meson в упаковку debian
sv: Lägger till meson-beroende till debian-paket.

source: Fix debian packaging
es: Corrección del empaquetado Debian
ru: Исправлена упаковка для debian
sv: Fixar debian-paket

source: Initial release
es: Publicación inicial
ru: Начальный выпуск
sv: Inledande utgåva

source: Application Entry Editor
es: Editor de entradas de aplicaciones
ru: Редактор свойств приложений
sv: Programpostsredigerare

source: Edit application entries
es: Editar entradas de aplicaciones
ru: Редактируйте свойства приложений
sv: Redigera programposter

source: application;edit;entry;
es: aplicación;editar;entrada;
ru: application;edit;entry;приложение;редактор;редактировать;запись
sv: program;redigera;post;

source: Display name
es: Nombre mostrado
ru: Отображаемое имя
sv: Visningsnamn

source: Comment
es: Comentario
ru: Комментарий
sv: Kommentar

source: Show in Launcher
es: Mostrar en el lanzador
ru: Отображать в меню приложений
sv: Visa i programmenyn

source: Category
es: Categoría
ru: Категория
sv: Kategori

source: Visibility
es: Visibilidad
ru: Отображение
sv: Synlighet

source: Program to execute along with its arguments
es: Programa que ejecutar y sus argumentos
ru: Путь к программе с аргументами запуска

source: The working directory to run the program in
es: Directorio de ejecución del programa
ru: Рабочий каталог при запуске программы
sv: Arbetsmappen som programmet skall köras i

source: Command Line
es: Línea de órdenes
ru: Командная строка
sv: Kommandorad

source: Working Directory
es: Directorio de trabajo
ru: Рабочая папка
sv: Arbetsmapp

source: Launch in Terminal
es: Iniciar en el terminal
ru: Запускать в терминале
sv: Starta i terminal

source: Launching
es: Ejecutar
ru: Параметры запуска
sv: Startar

source: Uses Notifications
es: Utiliza notificaciones
ru: Использует уведомления
sv: Användarnotis

source: Advanced
es: Avanzado
ru: Дополнительно
sv: Avancerat

source: Save
es: Guardar
ru: Сохранить
sv: Spara

source: Open in Text Editor
es: Abrir en el editor de textos
ru: Открыть в текстовом редакторе
sv: Öppna i textredigerare

source: Duplicate
es: Duplicar
ru: Дублировать
sv: Duplicera

source: Changes successfully saved
es: Cambios guardados correctamente
ru: Изменения успешно сохранены
sv: Ändringarna sparades

source: Something went wrong and the changes could not be saved: %s
es: Algo salió mal y no se han podido guardar los cambios: %s
ru: Что-то пошло не так, и изменения не могут быть сохранены: %s
sv: Något gick fel och ändringarna kunde inte sparas: %s

source: No visible title in the applications menu
es: Título no visible en el menú de aplicaciones
ru: Нет отображаемого имени в меню приложений
sv: Inget synligt namn i programmenyn

source: No program will be launched
es: No se ejecutará ningún programa
ru: Программа не будет запущена
sv: Inget program kommer att startas

source: The executable name (first argument) cannot contain the equal sign
es: El nombre del ejecutable (primer argumento) no puede contener el signo de igualdad
ru: Имя исполняемого файла (первый аргумент) не может содержать знак равенства
sv: Den körbara filens namn (första argumentet) får inte innehålla likhetstetecken

source: Entered file does not exist
es: El archivo proporcionado no existe
ru: Введённый файл не существует
sv: Den angivna filen finns inte

source: Entered program was not found
es: No se encontró el programa proporcionado
ru: Введённая программа не найдена
sv: Det angivna programmet hittades inte

source: Do You Want to Delete This Entry?
es: ¿Quiere eliminar esta entrada?
ru: Вы действительно хотите удалить эту запись?
sv: Vill du ta bort den här posten?

source: Deleting this entry is permanent and cannot be undone. This does not delete the application itself, only the entry shown in the applications menu.
es: Eliminar esta entrada es permanente y no se puede deshacer. Esto no elimina la aplicación en sí, sino la entrada que se muestra en el menú de aplicaciones.
ru: Удаление этой записи не может быть отменено. Будет удалено не само приложение, а только запись, отображаемая в меню приложений.
sv: Borttagning av den här posten är permanent och kan inte ångras. Detta tar inte bort själva programmet, bara posten som visas i programmenyn.

source: Delete
es: Eliminar
ru: Удалить
sv: Ta bort

source: Do You Want to Restore The Defaults?
es: ¿Quiere restablecer los valores predeterminados?
ru: Вы хотите восстановить значения по умолчанию?
sv: Vill du återställa standardvärdena?

source: Restoring defaults will undo all the changes done to this entry.
es: Restaurar los valores predeterminados deshará todos los cambios realizados en esta entrada.
ru: Восстановление значений по умолчанию позволит отменить все изменения, сделанные в этой записи.
sv: Återställning av standardvärden kommer att radera alla ändringar som gjorts i den här posten.

source: Restore defaults
es: Restaurar valores predeterminados
ru: Восстановить значения по умолчанию
sv: Återställ standardvärden

source: Cancel
es: Cancelar
ru: Отменить
sv: Avbryt

source: Could Not Open This Entry
es: No se pudo abrir esta entrada
ru: Невозможно открыть эту запись
sv: Kunde inte öppna den här posten

source: Delete entry…
es: Eliminar entrada…
ru: Удалить запись…
sv: Ta bort post…

source: Restore defaults…
es: Restaurar valores predeterminados…
ru: Восстановить значения по умолчанию…
sv: Återställ standardvärden…

source: New Application
es: Aplicación nueva
ru: Новое приложение
sv: Nytt program

source: Could not load the newly saved file.
es: No se pudo cargar el archivo recién guardado.
ru: Не удалось загрузить только что сохраненный файл.
sv: Kunde inte läsa in den nysparade filen.

source: No Item Selected
es: Ningún elemento seleccionado
ru: Ничего не выбрано
sv: Inget objekt valt

source: Select an application or start typing to edit one
es: Seleccione una aplicación o escriba para editar una concreta
ru: Выберите приложение или начните вводить текст для поиска
sv: Markera ett program eller börja skriva för att redigera ett

source: Unknown
es: Desconocido
ru: Неизвестно
sv: Okänt

source: Could not Find "%s"
es: No se encontró «%s»
ru: Не удалось найти «%s»
sv: Kunde inte hitta "%s"

source: Could not Find Requested File
es: No se pudo encontrar el archivo solicitado
ru: Не удалось найти запрошенный файл
sv: Kunde inte hitta efterfrågad fil

source: File <b>"%s"</b> does not exist.
es: El archivo «<b>%s</b>» no existe.
ru: Файл <b>«%s»</b> не существует/
sv: Filen <b>"%s"</b> finns inte.

source: Could Not Create a New Application Entry from "%s"
es: No se pudo crear una entrada de aplicación nueva a partir de «%s»
ru: Не удалось создать новую запись от «%s»
sv: Kunde inte skapa en ny programpost utifrån "%s"

source: Could Not Create a New Application From Requested File
es: No se pudo crear una entrada de aplicación nueva a partir del archivo solicitado
ru: Не удалось создать новую запись из запрошенного файла
sv: Kunde inte skapa ett nytt program utifrån den begärda filen

source: Sound & Video
es: Sonido y vídeo
ru: Аудио и видео
sv: Ljud & video

source: Sound
es: Sonido
ru: Аудио
sv: Ljud

source: Video
es: Vídeo
ru: Видео

source: Programming
es: Programación
ru: Программирование
sv: Programmering

source: Education
es: Educación
ru: Образование
sv: Utbildning

source: Games
es: Juegos
ru: Игры
sv: Spel

source: Graphics
es: Gráficos
ru: Графика
sv: Grafik

source: Internet
ru: Интернет

source: Office
es: Ofimática
ru: Офис
sv: Kontor

source: Science
es: Ciencia
ru: Наука
sv: Vetenskap

source: Settings
es: Configuración
ru: Настройки
sv: Inställningar

source: System Tools
es: Herramientas del sistema
ru: Системные утилиты
sv: Systemverktyg

source: Accessories
es: Accesorios
ru: Утилиты
sv: Tillbehör

source: Other
es: Otros
ru: Другое
sv: Övrigt

source: Icon name or path to an image
es: Nombre de icono o ruta a una imagen
ru: Имя иконки или путь к изображению
sv: Ikonnamn eller sökväg till en bild

source: Choose from file
es: Seleccione un archivo
ru: Выбрать из файла
sv: Välj från en fil

source: Choose from available icons
es: Seleccionar de los iconos disponibles
ru: Выбрать из доступных значков
sv: Välj från tillgängliga ikoner

source: All Files
es: Todos los archivos
ru: Все файлы
sv: Alla filer

source: Images
es: Imágenes
ru: Изображения
sv: Bilder

source: Select an image
es: Seleccione una imagen
ru: Выберите изображение
sv: Välj en bild

source: Choose
es: Seleccionar
ru: Выбрать
sv: Välj

source: Search icons…
es: Buscar iconos…
ru: Поиск значка…
sv: Sök ikoner…

source: Choose an icon from the list
es: Seleccione un icono de la lista
ru: Выбрать значок из списка
sv: Välj en ikon från listan

source: Show hidden entries
es: Mostrar entradas ocultas
ru: Отображать скрытые записи
sv: Visa dolda poster

source: No Applications Found
es: No se encontró ninguna aplicación
ru: Приложения не найдены
sv: Inga program hittades

source: Could not find any applications to edit on this system
es: No se han encontrado aplicaciones que editar en este sistema
ru: Не удалось найти никаких приложений для редактирования
sv: Kunde inte hitta några program att redigera, i systemet.

source: Retry
es: Reintentar
ru: Повторить
sv: Försök igen

source: Find…
es: Buscar…
ru: Поиск…
sv: Sök…

source: New entry
es: Entrada nueva
ru: Новая запись
sv: Ny post

source: Could Not Duplicate %s
es: No se pudo duplicar %s
ru: Не удалось дублировать %s
sv: Kunde inte duplicera %s

source: Could Not Create a New Application Entry
es: No se pudo crear una entrada de aplicación nueva
ru: Невозможно создать новую запись
sv: Kunde inte skapa någon ny programpost
